#Результат ССЫЛКА на google docx(или аналоги)
# с отчетом или физический файл с отчетом или ссылка на readme.md

#https: // github.com / makarova1507ana / test_repository_312 - последняя практика
#https: // github.com / makarova1507ana / python312 / blob / main / % D0 % 9 A % D0 % BE % D0 % BC % D0 % B0 % D0 % BD % D0 % B4 % D1 % 8 B % 20 % D0 % B3 % D0 % B8 % D1 % 82.
# txt - файл с основными коммандами гит

#---------------------------ЗАДАНИЕ--------------------------------------------#
#ВАЖНО: любо выполните предыдущее домашнее задание и продолжите работу в этом репозитории,
# либо создайте новый репозиторий хотя бы с одним коммитом

#1 часть задания
#1. Создать новую ветку “new_branch”
#2. выполните команду git checkout new_branch
#3. добавьте новый файл task1.py
#4. добавьте этот файл в индекс
#5.создайте коммит в этой ветке
#6. выполните команду git log и сделайте скрин вашего терминала

#2 часть задания
# 1. https: // github.com / зарегистрируйтесь(можно выбрать и любой другой сервис, но
# я буду использовать именно github)
# 2. создайте новый репозиторий, сделайте его публичным добавьте readme.md файл
# 3. отредактируйте readme.md и добавьте ему подпись “это мой репозиторий”
# 4. Пришлите скрин о проделанной работе или ссылку на readme.md я беру из адресной строки(пример
# https: // github.com / makarovat1507ana / python312 / blob / main / README.md)